<?php

return [
    "subject" => "التحقق من عنوان البريد الإلكتروني",
    "line" => "انقر فوق الزر أدناه للتحقق من عنوان بريدك الإلكتروني.",
    "action" => "التحقق من عنوان البريد الإلكتروني",
    "send_code_email" => "لقد أرسلنا لك رمز التحقق إلى بريدك الإلكتروني المسجل لدينا",
    "hello_dear" => "مرحبا عزيزي",
    "msg_1" => "إذا كنت تواجه مشكلة في النقر على زر \":actionText\"، فانسخ عنوان URL والصقه أدناه\n",
    "msg_2" => "في متصفح الويب الخاص بك:",
    "regards" => "مع تحيات فريق",
    "whoops" => "عفوًا",
    "not_verification_code" => "لم تحصل على رمز التحقق",
    "resend" => "إعادة ارسال",
];
