<?php

return [
    "title_error_404" => "شيء  ما مفقود",
    "desc_error_404" => "عذرا ، لا يمكننا العثور على الصفحة المقصودة. ستجد الكثير لاستكشافه في الصفحة الرئيسية",
    "login" => "هناك خطأ في البريد الإلكتروني أو كلمة المرور الخاصة بك، أو إن حسابك مفقود",
    "error" => "خطأ",
    "not_en_file_name" => "اللغة المستخدمة في إسم الملف ليست انجليزية",
    "error_message" => "لم يتم إرسال الرسالة يوجد خطأ ما. يرجى المحاولة في وقت لاحق",
    "trans" => "عليك أختيار المفاتيح او القيم او كليهما",
    "json_syntax" => "بناء جملة json غير صحيح",
];
