<?php

return [
    'title_index' => 'ملفات ترجمة لغوية للمواقع والتطبيقات بصيغة json',
    //
    'title_1' => 'ما هو المقصود بالملفات اللغوية',
    'description_1' => 'إن المواقع الإلكترونية والتطبيقات بحاجة الى نصوص توضح فكرة عمل كل جزء منها, ويتم استخدام النصوص في بعض الاحيان داخل الشفرة مباشرة هذا جيد لكن ليس بالشيئ المثالي لان الافضل عزل النصوص عن الشفرة حتى وإن كان الموقع او التطبيق يعتمد على لغة واحدة لضمان إن النصوص لا يتم تكرارها والاهم إن التصحيح والتدقيق للنصوص يكون في ملف او ملفات مخصصة منعزلة بعيدة عند الشفرة نهائيا. لذلك ومن خلال موقعنا وفرنا لكم ملفات json لاغلب الكلمات والنصوص التي يمكن أن تستخدم في المواقع والتطبيقات وتم فرزها بناءاً على النوع مثل تسجيل الدخول او المتصفحات او  بيئات التطوير المتكاملة.',
    //
    'title_2' => 'ما هي ملفات json التي نستخدمها',
    'description_2' => 'جسون (بالإنجليزية: JSON JavaScript Object Notation)‏، اختصار ل: ترميز الكائنات باستعمال جافا سكريبت، هي صيغة تبادل بيانات خفيفة الوزن، ذات معيار مفتوح. وتستند إلى نص، يكون تمثيل البيانات بصيغه بسيطه ومصفوفات مترابطه قابله لقراءه الإنسان تسمى كائنات (objects) تنسيق جسون محددة أصلا في ار اف سي (RFC 4627 من قبل دوغلاس كروكفورد نوع جسون الرسمي في الإنترنت هو application/json امتداد ملفات جسون هي.json تنسيقات جسون غالبا ما تستخدم لنقل وتنظيم تسلسل البيانات عبر شبكات الاتصال تطبيقه الرئيسي هو في اياكس (AJAX) برمجة تطبيقات الويب، حيث أنها تخدم كبديل لصيغة لغة الترميز القابلة للامتداد (XML)',
    'link_1' => 'من ويكيبيديا',
    //
    'title_3' => 'هل أنت بحاجة الى الملفات التي ننشئها',
    'description_3' => 'نعم أنت بحاجة الى مثل هذه الملفات لإنها توفر عليك وقت كتابة النصوص وهو وقت كبير بالاخص إذا كان الموقع او التطبيق كبير يمكن الاستفادة من هذه الملفات في اي طريقة تطوير للموقع او التطبيق تستخدم مثلا مستخدمين laravel يتم استخدام array php طريقة تحويل json الى array php سهلة جدا فقط إفتح الملف في إي محرر نصوص وقم بأستبدال كل نقطتان رأسيتان بعلامة يساوي واكبر من وهكذا الامر بسيط اقلها ابسط من كتابة النصوص نفسها في كل مرة تنشىء موقع أو تطبيق.',
];
