<?php

return [
    'title_index' => 'ملفات ترجمة لغات للمواقع والتطبيقات',
    //
    'title_1' => ' ما هو المقصود بملفات ترجمة اللغات التي نوفرها',
    'description_1' => 'إن المواقع الإلكترونية والتطبيقات بحاجة الى نصوص توضح فكرة عمل كل جزء منها, ويتم استخدام النصوص في بعض الاحيان داخل الشفرة مباشرة هذا جيد لكن ليس بالشيئ المثالي لان الافضل عزل النصوص عن الشفرة حتى وإن كان الموقع او التطبيق يعتمد على لغة واحدة لضمان إن النصوص لا يتم تكرارها والاهم إن التصحيح والتدقيق للنصوص يكون في ملف او ملفات مخصصة منعزلة بعيدة عند الشفرة نهائيا. لذلك ومن خلال موقعنا وفرنا لكم ملفات json لاغلب الكلمات والنصوص التي يمكن أن تستخدم في المواقع والتطبيقات وتم فرزها بناءاً على النوع مثل تسجيل الدخول او المتصفحات او  بيئات التطوير المتكاملة.',
    //
    'title_2' => 'ماهي انواع الملفات او البيانات المتوفرة',
    'description_2' => 'في موقع langfiles نوفر لك عدة انواع من الملفات سواءً كنت مطور تطبيقات ios او android او flutter او كنت مطور مواقع الكترونية باستخدام laravel او django او symfony فأن هذه الملفات تعمل معك وتقوم باختصار وقت كتابة النصوص يدويا. لان الملفات تعمل على flutter بصيغة json وتعمل على android بصيغة xml وتعمل على ios بصيغة string وتعمل على laravel بصيغة php وتعمل على django بصيغة po وتعمل على symfony بصيغة xlf.',
    'link_1' => 'من ويكيبيديا',
    //
    'title_3' => 'هل أنت بحاجة الى الملفات التي ننشئها',
    'description_3' => 'نعم أنت بحاجة الى مثل هذه الملفات لإنها توفر عليك وقت كتابة النصوص وهو وقت كبير بالاخص إذا كان الموقع او التطبيق كبير يمكن الاستفادة من هذه الملفات في اي طريقة تطوير للموقع او التطبيق تستخدم مثلا مستخدمين laravel يتم استخدام array php طريقة تحويل json الى array php سهلة جدا فقط إفتح الملف في إي محرر نصوص وقم بأستبدال كل نقطتان رأسيتان بعلامة يساوي واكبر من وهكذا الامر بسيط اقلها ابسط من كتابة النصوص نفسها في كل مرة تنشىء موقع أو تطبيق.',
];
