<?php

return [
    'title_' => '',
    'description_' => '',
    //
    'title_home' => 'ملفات ترجمة لغوية للمواقع والتطبيقات',
    'description_home' => 'ملفات ترجمة لغوية للمواقع والتطبيقات هي ملفات نصية تحتوي على النص المترجم للموقع أو التطبيق. يمكن استخدام هذه الملفات لتحديث الموقع أو التطبيق بلغات متعددة. عادةً ما يتم إنشاء ملفات ترجمة لغوية للمواقع والتطبيقات بواسطة مترجمين محترفين',
    //
    'title_types' => 'ملفات ترجمة لغوية تم تصنيفها حسب النوع',
    'description_types' => 'ملفات ترجمة لغوية تم تصنيفها حسب النوع مثل اسماء المتصفحات او برامج التصميم ثنائي الابعاد وهكذا',
    //
    'title_file' => 'عرض ملف ترجمة اللغة للنوع :TYPE بصيغة جيسون',
    'description_file' => 'يتم عرض ملف ترجمة اللغة للنوع :TYPE بصيغة جيسون حتى تتمكن من رؤية البيانات وايضا يمكنك ازالة القيمة التي تريد ثم تنسخ المحتوى',
    //
    'title_keys' => 'نصوص ترجمة لغوية للمواقع والتطبيقات',
    'description_keys' => 'نصوص ترجمة لغوية تم تجميعها جميعا في صفحة واحدة حتى نوفر لك طريقة ثانية لإنشاء مجموعتك الخاصة من البيانات.',
    //
    'title_login' => 'تسجيل الدخول',
    'description_login' => 'تسجيل الدخول',
    //
    'title_register' => 'إنشاء حساب جديد',
    'description_register' => 'إنشاء حساب جديد',
    //
    'title_articles' => 'مقالات إحترافية في كل المجالات',
    'description_articles' => 'في صفحة المدونة نقدم لم مقالات إخترافية في كل المجالات مثل البرمجة والتصميم والكتابة بأنواعها إستمتع',
    //
    'title_404' => 'الصفحة غير موجودة 404',
    'description_404' => 'الصفحة غير موجودة 404 إن الصفحة التي تبحث عنها ربما تمت إزالتها او ان الرابط يحتوي على خطأ إنتقل الى الصفحة الرئيسية لإكتشاف المزيد',
    //
    'title_convert' => 'تحويل json إلى php و android والمزيد',
    'description_convert' => 'هل عندك بيانات بصيغة json تريد تحويلها الى صيغ مختلفة تعمل كملفات ترجمة على android او ios او laravel وغيرها الكثير مع اداتنا صار الامر سهل جدا',
    //
    'title_add_texts' => 'إضافة نصوص ترجمة لغوية لدعم الموقع',
    'description_add_texts' => 'ادعم موقع langfiles بإضافة نصوص ترجمة لغوية، فهذه النصوص يستخدمها الالاف من المطورين لذلك ندعوك لمساعدتنا الامر بسيط كل ماعليك اختيار اللغة وادخال المفتاح و القيمة.',
    //
    'title_2_types' => 'ملفات ترجمة لغوية لمطوري المواقع والتطبيقات',
    'title_2_keys' => 'نصوص ترجمة لغوية لمطوري المواقع والتطبيقات',
];
