<?php

return [
    'title_' => '',
    'description_' => '',
    // START SEO
    //
    'title_home' => 'توطين او تعريب المواقع والتطبيقات والألعاب',
    'description_home' => 'ملفات لغات لتوطين او تعريب المواقع والتطبيقات والألعاب يتكون الملف من مفاتيح وقيم تعمل على العديد من الانواع مثل Laravel و Django و Unity و Flutter وغيرهم.',
    //
    'title_types' => 'تصنيف ملفات توطين او تعريب اللغة حسب النوع',
    'description_types' => 'يتم تصنيف ملفات توطين او تعريب اللغة حسب النوع مثل أسماء المتصفحات، وأسماء برامج النمذجة ثنائية الأبعاد، وأسماء البلدان أو اللغات، وغير ذلك الكثير.',
    //
    'title_file' => 'عرض ملف توطين او تعريب اللغة للنوع :TYPE بصيغة json',
    'description_file' => 'يتم عرض ملف توطين او تعريب اللغة للنوع :TYPE بصيغة json حتى تتمكن من رؤية البيانات وايضا يمكنك ازالة القيمة التي تريد ثم تنسخ المحتوى. او  تقوم بإنشاء مجموعة مخصصة تقوم بجمع بياناتها من عدة انواع او تصنيفات ثم تنسخ البيانات الى موقعك او تطبيقك او لعبتك.',
    //
    'title_keys' => 'نصوص توطين او تعريب اللغات للمواقع والتطبيقات والالعاب',
    'description_keys' => 'نصوص توطين او تعريب اللغات تم جمعها في صفحة واحدة حتى نوفر لك طريقة ثانية لإنشاء مجموعتك الخاصة من البيانات مع توفير ميزة البحث من خلال المفتاح او القيمة.',
    //
    'title_articles' => 'مقالات تشرح توطين او تعريب المواقع والتطبيقات والألعاب',
    'description_articles' => 'في صفحة المدونة نقدم لك مقالات نشرح فيها توطين او تعريب المواقع والتطبيقات والألعاب بجميع انواعها مثل مواقع laravel او العاب unity وغيرهم الكثير إستمتع.',
    //
    'title_add_texts' => 'إضافة نصوص توطين او تعريب لغات لدعم موقع langfiles',
    'description_add_texts' => 'ادعم موقع langfiles بإضافة نصوص ترجمة لغات لتوطين او تعريب المواقع والتطبيقات والألعاب. فهذه النصوص يستخدمها الالاف من المطورين لذلك ندعوك لمساعدتنا الامر بسيط كل ماعليك اختيار اللغة وادخال المفتاح و القيمة.',
    //
    'title_convert' => 'قم بتحويل json إلى عدة امتدادات لتوطين او تعريب مشاربعك',
    'description_convert' => 'هل عندك بيانات بصيغة json تريد تحويلها الى صيغ مختلفة لتوطين او تعريب المواقع والتطبيقات والألعاب مع langfiles صار الامر سهلا جدا. ايضا يمكنك اضافة قيمة جديدة الى مجموعتك وترجمتها من اللغة العربية الى اللغة الانجليزية.',
    //
    'title_contributors' => 'قائمة المساهمين المذهلين في langfiles',
    'description_contributors' => 'لقد قدم هؤلاء الأشخاص تضحيات مذهلة في إنشاء وتطوير موقع langfiles لأنهم بذلوا فيه الكثير من الوقت والجهد، وأقل ما يمكن أن نقدمه لهم هو تخليد أسمائهم في هذه الصفحة. شكرا لهم على هذا العمل الرائع .',
    //
    // END SEO
    //
    'title_profile' => 'الملف الشخصي للعضو :USER',
    'description_profile' => 'مرحبا بك ايها العضو :USER في موقع langfiles لتوطين او تعريب المواقع والتطبيقات والألعاب',
    //
    'title_404' => 'الصفحة غير موجودة 404',
    'description_404' => 'الصفحة غير موجودة 404 إن الصفحة التي تبحث عنها ربما تمت إزالتها او ان الرابط يحتوي على خطأ إنتقل الى الصفحة الرئيسية لإكتشاف المزيد',
    //
    'title_login' => 'تسجيل الدخول',
    'description_login' => 'سجل دخولك الان الى موقع langfiles وتتمتع بالعديد من الميزات القوية والمفيدة.',
    //
    'title_register' => 'إنشاء حساب جديد',
    'description_register' => 'انشاء حساب مجاني في موقع langfiles وتتمتع بالعديد من الميزات القوية والمفيدة.',
    //////////////////////////////////////////////
    //////////////////////////////////////////////
    //////////////////////////////////////////////
    //////////////////////////////////////////////
    'title_mustafamax' => 'مطور مواقع وتطبيقات باستخدام Flutter و Laravel',
    'desc_mustafamax' => 'مطور تطبيقات android و ios باستخدام flutter وايضا مطور مواقع الكترونية بإستخدام laravel. لقد قمت بإنشاء هذا الموقع لتقصير الوقت الذي يقضيه المبرمجون في إنشاء ملفات اللغة وترجمة هذه الملفات. كل هذا اصبح من الماضي الآن. مع موقع langfiles لا داعي للقلق قم بنسخ النصوص المتوفرة لكل المجالات وبكل الامتدادات والصقها في مشروعك.',
    'profile_facebook_mustafamax' => 'الملف الشخصي فيسبوك',
    'page_facebook_mustafamax' => 'صفحة langfiles فيسبوك',
    'youtube_mustafamax' => 'قناتنا على youtube',
    'instagram_mustafamax' => 'قناتنا على instagram',
    'tiktok_mustafamax' => 'قناتنا على tiktok',
    'website_mustafamax' => 'الموقع إلكتروني',
];
