<?php

return [
    'title_' => '',
    'description_' => '',
    //
    'title_home' => 'ملفات ترجمة لغوية للمواقع والتطبيقات',
    'description_home' => 'ملفات ترجمة لغوية للمواقع والتطبيقات هي ملفات نصية تحتوي على النص المترجم للموقع أو التطبيق. يمكن استخدام هذه الملفات لتحديث الموقع أو التطبيق بلغات متعددة. عادةً ما يتم إنشاء ملفات ترجمة لغوية للمواقع والتطبيقات بواسطة مترجمين محترفين',
    //
    'title_types' => 'ملفات ترجمة لغوية تم تصنيفها حسب النوع',
    'description_types' => 'ملفات ترجمة لغوية تم تصنيفها حسب النوع مثل اسماء المتصفحات او برامج التصميم ثنائي الابعاد وهكذا',
    //
    'title_file' => 'عرض ملف ترجمة اللغة للنوع :TYPE بصيغة جيسون',
    'description_file' => 'يتم عرض ملف ترجمة اللغة للنوع :TYPE بصيغة جيسون حتى تتمكن من رؤية البيانات وايضا يمكنك ازالة القيمة التي تريد ثم تنسخ المحتوى',
    //
    'title_keys' => 'نصوص ترجمة لغوية للمواقع والتطبيقات',
    'description_keys' => 'نصوص ترجمة لغوية تم تجميعها جميعا في صفحة واحدة حتى نوفر لك طريقة ثانية لإنشاء مجموعتك الخاصة من البيانات.',
    //
    'title_login' => 'تسجيل الدخول',
    'description_login' => 'تسجيل الدخول',
    //
    'title_register' => 'إنشاء حساب جديد',
    'description_register' => 'إنشاء حساب جديد',
    //
    'title_articles' => 'مقالات إحترافية في كل المجالات',
    'description_articles' => 'في صفحة المدونة نقدم لم مقالات إخترافية في كل المجالات مثل البرمجة والتصميم والكتابة بأنواعها إستمتع',
    //
    'title_404' => 'الصفحة غير موجودة 404',
    'description_404' => 'الصفحة غير موجودة 404 إن الصفحة التي تبحث عنها ربما تمت إزالتها او ان الرابط يحتوي على خطأ إنتقل الى الصفحة الرئيسية لإكتشاف المزيد',
    //
    'title_convert' => 'تحويل json إلى php و android والمزيد',
    'description_convert' => 'هل عندك بيانات بصيغة json تريد تحويلها الى صيغ مختلفة تعمل كملفات ترجمة على android او ios او laravel وغيرها الكثير مع اداتنا صار الامر سهل جدا',
    //
    'title_contributors' => 'قائمة المساهمين المذهلين في langfiles',
    'description_contributors' => 'لقد قدم هؤلاء الأشخاص تضحيات مذهلة في إنشاء وتطوير موقع langfiles لأنهم بذلوا فيه الكثير من الوقت والجهد، وأقل ما يمكن أن نقدمه لهم هو تخليد أسمائهم في هذه الصفحة. شكرا لهم على هذا العمل الرائع .',
    //
    'title_add_texts' => 'إضافة نصوص ترجمة لغوية لدعم الموقع',
    'description_add_texts' => 'ادعم موقع langfiles بإضافة نصوص ترجمة لغوية، فهذه النصوص يستخدمها الالاف من المطورين لذلك ندعوك لمساعدتنا الامر بسيط كل ماعليك اختيار اللغة وادخال المفتاح و القيمة.',
    //
    'title_2_types' => 'ملفات ترجمة لغوية لمطوري المواقع والتطبيقات',
    'title_2_keys' => 'نصوص ترجمة لغوية لمطوري المواقع والتطبيقات',
    //
    'title_mustafamax' => 'مطور مواقع وتطبيقات باستخدام Flutter و Laravel',
    'desc_mustafamax' => 'مطور تطبيقات android و ios باستخدام flutter وايضا مطور مواقع الكترونية بإستخدام laravel. لقد قمت بإنشاء هذا الموقع لتقصير الوقت الذي يقضيه المبرمجون في إنشاء ملفات اللغة وترجمة هذه الملفات. كل هذا اصبح من الماضي الآن. مع موقع langfiles لا داعي للقلق قم بنسخ النصوص المتوفرة لكل المجالات وبكل الامتدادات والصقها في مشروعك.',
    'profile_facebook_mustafamax' => 'الملف الشخصي فيسبوك',
    'page_facebook_mustafamax' => 'صفحة langfiles فيسبوك',
    'youtube_mustafamax' => 'قناتنا على youtube',
    'instagram_mustafamax' => 'قناتنا على instagram',
    'tiktok_mustafamax' => 'قناتنا على tiktok',
    'website_mustafamax' => 'الموقع إلكتروني',
];
