<?php

return [
    'title_' => '',
    'description_' => '',

    'title_home' => 'توطين او تعريب المواقع والتطبيقات والألعاب',
    'description_home' => 'ملفات لغات لتوطين او تعريب المواقع والتطبيقات والألعاب يتكون الملف من مفاتيح وقيم تعمل على العديد من الانواع مثل Laravel و Django و Unity و Flutter وغيرهم.',

    'title_types' => 'تصنيف نصوص توطين او تعريب المواقع والتطبيقات والالعاب',
    'description_types' => 'يتم تصنيف نصوص توطين او تعريب المواقع والتطبيقات والالعاب حسب النوع مثل أسماء المتصفحات، وأسماء المتصفحات، وأسماء البلدان أو اللغات، وغير ذلك الكثير.',

    'title_file' => 'عرض نصوص النوع :TYPE لتوطين او تعريب المواقع والتطبيقات والالعاب',
    'description_file' => 'عرض نصوص النوع :TYPE لتوطين او تعريب المواقع والتطبيقات والالعاب حتى تتمكن من رؤية البيانات وايضا يمكنك ازالة القيمة التي تريد ثم تنسخ المحتوى. او  تقوم بإنشاء مجموعة مخصصة تقوم بجمع بياناتها من عدة انواع او تصنيفات ثم تنسخ البيانات الى موقعك او تطبيقك او لعبتك.',

    'title_keys' => 'عرض جميع نصوص توطين او تعريب المواقع والتطبيقات والالعاب',
    'description_keys' => 'نصوص توطين او تعريب المواقع والتطبيقات والألعاب تم جمعها في صفحة واحدة حتى نوفر لك طريقة ثانية لإنشاء مجموعتك الخاصة من النصوص مع توفير ميزة البحث.',

    'title_articles' => 'مقالات تشرح توطين او تعريب المواقع والتطبيقات والألعاب',
    'description_articles' => 'في صفحة المدونة نقدم لك مقالات نشرح فيها توطين او تعريب المواقع والتطبيقات والألعاب بجميع انواعها مثل مواقع laravel او العاب unity وغيرهم الكثير إستمتع.',

    'title_convert' => 'قم بتحويل json إلى عدة امتدادات لتوطين او تعريب مشاربعك',
    'description_convert' => 'هل عندك بيانات بصيغة json تريد تحويلها الى صيغ مختلفة لتوطين او تعريب المواقع والتطبيقات والألعاب مع langfiles صار الامر سهلا جدا. ايضا يمكنك اضافة قيمة جديدة الى مجموعتك وترجمتها من اللغة العربية الى اللغة الانجليزية.',

    'title_contributors' => 'قائمة المساهمين المذهلين في موقعنا',
    'description_contributors' => 'لقد قدم هؤلاء الأشخاص تضحيات مذهلة في إنشاء وتطوير موقع langfiles لأنهم بذلوا فيه الكثير من الوقت والجهد، وأقل ما يمكن أن نقدمه لهم هو تخليد أسمائهم في هذه الصفحة. شكرا لهم على هذا العمل الرائع .',

    'title_project' => 'حدد ما يحتويه مشروعك لتحصل على ملف التوطين او التعريب',
    'description_project' => 'قم بإختيار ما يناسب المشروع الخاص بك، وبعد الانتهاء سيتم توفير نصوص التوطين او التعريب الخاصة بمشروعك.',

    'title_add_texts' => 'إضافة نصوص توطين او تعريب المواقع والتطبيقات والالعاب لدعمنا',
    'description_add_texts' => 'ادعمنا بإضافة نصوص لتوطين او تعريب المواقع والتطبيقات والألعاب. فهذه النصوص يستخدمها الاف المطورين. عليك فقط اختيار اللغة وادخال المفتاح و القيمة.',

    'title_profile' => 'الملف الشخصي للعضو :USER',
    'description_profile' => 'مرحبا بك ايها العضو :USER في موقع langfiles لتوطين او تعريب المواقع والتطبيقات والألعاب',

    'title_tools' => 'اكتب نصوص توطين أو تعريب مشروعك بلغة واحدة و حولها إلى عدة لغات',
    'description_tools' => 'إتصل بمشروعك المحلي لتعديل نصوص التوطين او التعريب. يتيح لك الإتصال كتابة البيانات بسرعة مذهلة مع إمكانية ترجمتها الى كل اللغات',

    'title_404' => 'الصفحة غير موجودة 404',
    'description_404' => 'الصفحة غير موجودة 404 إن الصفحة التي تبحث عنها ربما تمت إزالتها او ان الرابط يحتوي على خطأ إنتقل الى الصفحة الرئيسية لإكتشاف المزيد',

    'title_login' => 'تسجيل الدخول',
    'description_login' => 'سجل دخولك الان الى موقع langfiles وتتمتع بالعديد من الميزات القوية والمفيدة.',

    'title_register' => 'إنشاء حساب جديد',
    'description_register' => 'انشاء حساب مجاني في موقع langfiles وتتمتع بالعديد من الميزات القوية والمفيدة.',

    'title_email_verify' => 'التحقق من البريد الالكتروني',
    'description_email_verify' => 'من أجل التمتع بجميع مزايا موقع langfiles، يجب عليك إكمال عملية التحقق من البريد الإلكتروني الذي قمت بالتسجيل به.',

    'title_call_us' => 'إتصل بنا الآن لأي استفسار أو سؤال يخص الموقع',
    'description_call_us' => 'إتصل بنا الآن لأي استفسار أو سؤال يخص الموقع وسنرد عليك في اقرب وقت ممكن. ونعتذر منك مقدما اذا تآخر ردنا عليك. لكن تأكد ان الرد على سؤالك من أولوياتنا.',

    "title_delete_account" => "حذف الحساب",
    "description_delete_account" => "نرشدك في هذه الصفحة إلى كيفية حذف حسابك بالكامل من موقعنا. لإكمال عملية الحذف، يجب عليك تسجيل الدخول باستخدام البريد الإلكتروني وكلمة المرور لهذا الحساب. بعد الضغط على زر حذف الحساب، لا يمكنك التراجع عن ذلك",

    'title_mustafamax' => 'مطور مواقع وتطبيقات باستخدام Flutter و Laravel',
    'desc_mustafamax' => 'مطور تطبيقات android و ios باستخدام flutter وايضا مطور مواقع الكترونية بإستخدام laravel. لقد قمت بإنشاء هذا الموقع لتقصير الوقت الذي يقضيه المبرمجون في إنشاء ملفات اللغة وترجمة هذه الملفات. كل هذا اصبح من الماضي الآن. مع موقع langfiles لا داعي للقلق قم بنسخ النصوص المتوفرة لكل المجالات وبكل الامتدادات والصقها في مشروعك.',
    'profile_facebook_mustafamax' => 'الملف الشخصي فيسبوك',
    'page_facebook_mustafamax' => 'صفحة langfiles فيسبوك',
    'youtube_mustafamax' => 'قناتنا على youtube',
    'instagram_mustafamax' => 'قناتنا على instagram',
    'tiktok_mustafamax' => 'قناتنا على tiktok',
    'website_mustafamax' => 'الموقع إلكتروني',
];
