<?php

return [
    'title_' => '',
    'description_' => '',
    'key_words_' => '',
    //
    'title_home' => 'ملفات لغوية بصيغة جسون',
    'description_home' => 'إن المواقع الإلكترونية والتطبيقات بحاجة الى نصوص توضح فكرة عمل كل جزء منها, ويتم استخدام النصوص في بعض الاحيان داخل الشفرة مباشرة هذا جيد لكن ليس بالشيئ المثالي لان الافضل عزل النصوص عن الشفرة حتى وإن كان الموقع او التطبيق يعتمد على لغة واحدة لضمان إن النصوص لا يتم تكرارها',
    'key_words_home' => 'json, file, files, laravel, php, app, website, program',
    //
    'title_types' => 'تصنيف الملفات اللغوية حسب النوع',
    'description_types' => 'في هذه الصفحة يتم تصنيف الملفات اللغوية بناءاً على النوع مثل اسماء المتصفحات او برامج التصميم ثنائي الابعاد وهكذا',
    'key_words_types' => 'برامج, تصميم, تسجيل دخول, انشاء خساب',
    //
    'title_languages' => 'تصنيف الملفات اللغوية حسب اللعة',
    'description_languages' => 'في هذه الصفحة يتم تصنيف الملفات اللغوية حسب اللغة مثل اللغة العربية و اللغة الانجليزية',
    'key_words_languages' => 'اللغة العربية, اللغة الأنجليزية',
    //
    'title_files' => 'تصنيف الملفات اللغوية حسب الأسم',
    'description_files' => '',
    'key_words_files' => '',
    //
    'title_file' => 'عرض الملف بصيغة جسون',
    'description_filer' => '',
    'key_words_filer' => '',
];
