<?php

return [
    'title_' => '',
    'description_' => '',
    'key_words_' => '',
    //
    'title_home' => 'ملفات ترجمة لغوية للمواقع والتطبيقات',
    'description_home' => 'ملفات ترجمة لغوية للمواقع والتطبيقات هي ملفات نصية تحتوي على النص المترجم للموقع أو التطبيق. يمكن استخدام هذه الملفات لتحديث الموقع أو التطبيق بلغات متعددة. عادةً ما يتم إنشاء ملفات ترجمة لغوية للمواقع والتطبيقات بواسطة مترجمين محترفين',
    'key_words_home' => 'json, file, files, laravel, php, app, website, program, android, ios, phone',
    //
    'title_types' => 'ملفات ترجمة لغوية تم تصنيفها حسب النوع',
    'description_types' => 'ملفات ترجمة لغوية تم تصنيفها حسب النوع مثل اسماء المتصفحات او برامج التصميم ثنائي الابعاد وهكذا',
    'key_words_types' => 'برامج, تصميم, تسجيل دخول, انشاء حساب',
    //
    'title_file' => 'عرض ملف ترجمة اللغة للنوع :TYPE بصيغة جيسون',
    'description_file' => 'يتم عرض ملف ترجمة اللغة للنوع :TYPE بصيغة جيسون حتى تتمكن من رؤية البيانات وايضا يمكنك ازالة القيمة التي تريد ثم تنسخ المحتوى',
    'key_words_file' => 'json, laravel, flutter, android, ios, copy, delete, website, :TYPE',
    //
    'title_login' => 'تسجيل الدخول',
    'description_login' => '',
    'key_words_login' => '',
    //
    'title_register' => 'إنشاء حساب جديد',
    'description_register' => '',
    'key_words_register' => '',
    //
    'title_articles' => 'مقالات إحترافية في كل المجالات',
    'description_articles' => 'في صفحة المدونة نقدم لم مقالات إخترافية في كل المجالات مثل البرمجة والتصميم والكتابة بأنواعها إستمتع',
    'key_words_articles' => 'برمجة, تصميم, كتابة قصص, إنشاء مواقع الكترونية, انشاء تطبيقات',
    //
    'title_404' => 'الصفحة غير موجودة 404',
    'description_404' => 'الصفحة غير موجودة 404 إن الصفحة التي تبحث عنها ربما تمت إزالتها او ان الرابط يحتوي على خطأ إنتقل الى الصفحة الرئيسية لإكتشاف المزيد',
    'key_words_404' => 'الصفحة غير موجودة, 404, خطأ, الصفحة الرئيسية',
];
